na-mid-term.org
* 数值分析与科学计算引论
- 数值分析用于求解数学问题时不能求的解析解，从而通过数值方法来求其近似解
** 数值计算别的误差
- 通过其近似误差与其精确解之间的误差称为阶段误差或方法误差
- 其意义在于，通过误差来体现方法解决问题的性能
- 在考虑到在不同的问题中，误差的大小通常在不同的范围内浮动，又考虑到精确误差在实际问题中一般不易求的，因此，将近似值的误差与近似值的误差的比座位想读误差，其中分母为近似值的绝对值时，作为相对误差限。
- 有效数字与近似误差的关系有利于根据需求在问题中选择合适的方式来求的满足条件的近似解并兼顾计算效率。
* 插值法
- 插值法适用于拟合给定数据点的曲线，来获得某种数据点之间内在规律。
** 拉格朗日插值
- 拉格朗日插值法将近似函数作为基函数的线性组合。
- 其中基函数的形式受近似函数的最高项次数决定。
** 均差与牛顿差值多项式
- 为了适应于插值节点删减的情况，一种逐次生成插值多项式的方法被设计。
- 在定义了均差之后，每次迭代时增加当前插值节点的基函数与n阶均差的方法被称为牛顿插值多项式。
- 在任意两个插值节点等距的情况下，通过总结规律又有查分形式的牛顿差值公式。
** 埃尔米特插值
- 埃尔米特插值适用于各节点导数值或高阶导数值相等的情况。
- 不同与牛顿差值多项式，埃尔米特插值的最后一项，即包含所有节点的基函数一项的系数，通过到数相同的条件来求得，其余项系数同泰勒展开。
** 分段低次插值
- 分段低次插值即将节点分为多段，对于任一段，独立计算其插值函数。来规避高次插值的病态问题。
** 三次样条插值
- 由于分段插值在各段相连处存在不光滑的问题，为了获得更为平滑的曲线，即各交点处两侧导数存在且相等。
- 其中样条插值函数为埃尔米特插值的基函数的线性组合，其中，基函数的系数，通过自然边界条件来求得，这也保证了所得样条插值函数在交点上的光滑性。
* 函数逼近与快速傅里叶变换
** 函数逼近的基本概念
- 对于任意函数，可以用简单函数的线性组合来逼近。
** 正交多项式
- 勒让德多项式与切比雪夫分别为权函数不同时，由序列{x^n} 正交化得到的正交多项式。
- 通过这两种正交多项式的根进行插值，可以避免龙格现象。
** 最佳平方逼近
- 通过最小化目标函数与近似函数的差的范数的平方，来求解近似函数。将近似函数作为基函数的线性组合，则问题可化为求解基函数的系数的偏导数为零的方程组。
- 若基函数为正交函数族，则问题可化为求解广义傅里叶级数，而广义傅里叶级数通过计算各阶近似函数与目标函数的内积求得。
** 曲线拟合的最小二乘法
- 通过最小化目标函数与近似函数的差的平方，来求解近似函数。
- 根据实际情况，确定近似函数的形式，即通过最小化最小二乘法的代价函数，来求解近似函数的参数。
- 当近似函数为基函数的线性组合时，且基函数为正交函数族，则可根据已知的公式来求解基函数的系数，来求解近似函数。
** 有理逼近
- 有理逼近指通过形如两种近似函数的比值为近似函数来逼近目标函数，从而适用于目标函数在某点附近无界时的效果。
- 帕得逼近为求函数在原点时满足原点处n阶导数一致情况下的逼近，通过求解线性方程组求得。
** 三角多项式逼近与快速傅里叶变换
- 以周期函数为基函数的近似函数。
* 数值积分与数值微分
** 数值积分概论
- 数值积分用于求目标函数积分有难度的情况。
- 用代数精度来体现求积公式的性能。
- 可以将被积函数用插值函数来逼近，则有插值型的求积公式。
** 牛顿-柯特斯公式
- 通过将被积区间上的灯具店，通过插值多项式来逼近被积函数，通过求积差值多项式来获得数值积分。
** 复合求积公式
- 由于牛顿-柯特斯公式的性能限制，通过将被积区间划分为多个子区间，对各个子区间各自求得低次的多项式插值。
** 龙贝格求积公式
- 一种通过每次将子区间一分为二的方式来逐步获取更高精度的数值积分。每次递归可由递归公式求得新的近似值。
- 在近似值的误差能表示成h的幂级数时又有理查德外推法来加速精度的提升。
** 自适应求积公式
- 再对每个子区间进行辛普森公式，再考察其精度，则可减少计算次数。
** 高斯求积公式
- 将积分看作被积函数在某点的值的线性组合。
- 得到权函数的节点位置以及其系数的线性方程组。
- 以勒让德多项式货切比雪夫多项式的的根为权函数的节点，求解系数。
** 多重积分
- 通过复合辛普森公式将多重积分化为低重积分，直至可以直接使用复合辛普森公式对各个子积分求值。
** 数值微分
- 类似于导数求极限。
- 将原函数的近似函数的导数值作为原函数的导数的近似值。
